#+Title: Comandos básicos do Android
#+Subtitle:

* Tema
  Comandos básicos do Android

* Objetivo
   Apresentar comandos básicos e mais úteis do android

* Duração
  2 Aulas

* Pré-Requisitos
** Conhecimentos Prévios
   Configuração do ambiente de desenvolvimento do androi
   file:android_setup_env.org
   
** Recursos

* Procedimento didatico
** Exposição do assunto pelo professor
** Atividade Prática
   * buildando o projeto

   #+NAME: export projdir=...      
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      #export projdir=/home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/somewritings/android/projetos/sqlite
      export projdir=/home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/quickstart-android
      gradle -v
   #+END_SRC

   #+RESULTS: export projdir=...
   #+begin_example

   [wagner@nsi_pc_149_3 quickstart-android]$ [wagner@nsi_pc_149_3 quickstart-android]$ 
   ------------------------------------------------------------
   Gradle 5.1.1
   ------------------------------------------------------------

   Build time:   2019-01-10 23:05:02 UTC
   Revision:     3c9abb645fb83932c44e8610642393ad62116807

   Kotlin DSL:   1.1.1
   Kotlin:       1.3.11
   Groovy:       2.5.4
   Ant:          Apache Ant(TM) version 1.9.13 compiled on July 10 2018
   JVM:          1.8.0_191 (Oracle Corporation 25.191-b12)
   OS:           Linux 5.0.17-200.fc29.x86_64 amd64
   #+end_example

   
   #+NAME: gradlew assembleDebug               
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      ###entra na pasta do projeto
      cd $projdir
      
      ###limpa build anterior se tiver
      ./gradlew clean 2>1&
      
      ###mostra que nao ha apk antes do assembleDebug (nao tem diretorio debug)
      #ls $projdir/app/
      
      ###build variate debug
      ./gradlew assembleDebug #--debug #--stacktrace
      
      ###mostra que tem o apk contruido
      ls -l $projdir/app/build
   #+END_SRC

   #+RESULTS: gradlew assembleDebug
   #+begin_example

   [wagner@nsi_pc_149_3 quickstart-android]$ [wagner@nsi_pc_149_3 quickstart-android]$ [wagner@nsi_pc_149_3 quickstart-android]$ [wagner@nsi_pc_149_3 quickstart-android]$ 
   ------------------------------------------------------------
   Gradle 5.1.1
   ------------------------------------------------------------

   Build time:   2019-01-10 23:05:02 UTC
   Revision:     3c9abb645fb83932c44e8610642393ad62116807

   Kotlin DSL:   1.1.1
   Kotlin:       1.3.11
   Groovy:       2.5.4
   Ant:          Apache Ant(TM) version 1.9.13 compiled on July 10 2018
   JVM:          1.8.0_191 (Oracle Corporation 25.191-b12)
   OS:           Linux 5.0.17-200.fc29.x86_64 amd64
   #+end_example


* rodando o projeto
  
   #+NAME: ./gradlew installDebug   
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      
      ### Entrando no dir do projeto
      cd $projdir
      
      ### Vendo qual dispositivo a gente vai instalar o apk
      adb devices

      ### Instalando
      ./gradlew installDebug

   #+END_SRC

   
   #+NAME: adb shell am start -n    
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      ### Iniciando a aplicacao no dispositivo
      adb shell am start -n "eteczl.edu.br.exampleloginapp2/.ManterUsuarioActivity"
   #+END_SRC

   #+RESULTS: adb shell am start -n
   : 
   : starts code
   : ### Iniciando a aplicacao no dispositivo
   : adb shell am start -n "eteczl.edu.br.exampleloginapp2/.ManterUsuarioActivity"
   : Starting: Intent { cmp=eteczl.edu.br.exampleloginapp2/.ManterUsuarioActivity }



   #+NAME:  whatch logcat app                   
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      
   #+END_SRC

* Exercicios e Atividades de Reflexão/Fixação
* Avaliação
* Referencias


